#ifndef __EXTI_H__
#define __EXTI_H__

#include "sys.h"

/* ---------------------------------------------------------------------------------- */
/* [硬件移植区] 外部中断 (EXTI) 引脚及硬件资源定义                                       */
/* ---------------------------------------------------------------------------------- */
#define EXTI_1_PIN                      GPIO_PIN_1
#define EXTI_1_PORT                     GPIOA
#define EXTI_1_CLK_ENABLE()             __HAL_RCC_GPIOA_CLK_ENABLE()
#define EXTI_1_IRQn                     EXTI1_IRQn

/* ---------------------------------------------------------------------------------- */
/* [功能接口声明区]                                                                    */
/* ---------------------------------------------------------------------------------- */

// 初始化外部中断控制器
void exti_init(void);

#endif
